#+OPTIONS: toc:nil ^:nil

** Ori

   Let's look at the input data, the genome of Salmonella enterica:

   #+BEGIN_SRC sh :exports both :results value verbatim
     head -n5 ../data/Salmonella_enterica.txt
   #+END_SRC

   #+RESULTS:
   : >gi|16758993|ref|NC_003198.1| Salmonella enterica subsp. enterica serovar Typhi str. CT18 chromosome, complete genome
   : AGAGATTACGTCTGGTTGCAAGAGATCATAACAGGGGAAATTGATTGAAAATAAATATATCGCCAGCAGC
   : ACATGAACAAGTTTCGGAATGTGATCAATTTAAAAATTTATTGACTTAGGCGGGCAGATACTTTAACCAA
   : TATAGGAATACAAGACAGACAAATAAAAATGACAGAGTACACAACATCCATGAACCGCATCAGCACCACC
   : ACCATTACCACCATCACCATTACCACAGGTAACGGTGCGGGCTGACGCGTACAGGAAACACAGAAAAAAG

   This is [[https://en.wikipedia.org/wiki/FASTA_format][FASTA format]], where the first line is a comment with the description
   of dataset, and the rest of the lines is DNA sequence.

   #+BEGIN_SRC sh :exports both
     wc -c ../data/Salmonella_enterica.txt
   #+END_SRC

   #+RESULTS:
   : 4877856 ../data/Salmonella_enterica.txt

   We need to find the origin of replication /ori/ of size about 1000
   nucleotides in a 5 million long DNA sequence. In order to find it will
   analyze the DNA given some knowledge, namely the deamination process.

